app/controllers/application_controller.rb

SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def current_user
        if session[:patient_id]
            @patient = Patient.find(session[:patient_id])