app/controllers/appointments_controller.rb

SELECT "doctors".* FROM "doctors"
---
    def new
        @doctors = Doctor.all

INSERT INTO "appointments" ("patient_id", "doctor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["patient_id", 2], ["doctor_id", 1], ["created_at", "2020-05-29 07:39:22.877340"], ["updated_at", "2020-05-29 07:39:22.877340"]]
---
    def create
        @appointment = Appointment.new(appointment_params)
        @appointment.patient = @patient
        @appointment.save

SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def get_patient
        @patient = Patient.find(session[:patient_id])