app/controllers/doctors_controller.rb

SELECT "patients".* FROM "patients"
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    @patients = Patient.all
    @doctor = Doctor.find(params[:id])

SELECT "licenses".* FROM "licenses" WHERE "licenses"."number" = ? LIMIT ?  [["number", 1234567], ["LIMIT", 1]]
INSERT INTO "doctors" ("name", "email", "password_digest", "license_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @doctor = Doctor.new(doctor_params)
    license = License.find_by(number: params[:doctor][:license_id].to_i)
    @doctor.license_id = license.id
    if @doctor.valid?
      @doctor.save