app/controllers/patients_controller.rb

SELECT "doctors".* FROM "doctors"
SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @doctors = Doctor.all
    @patient = Patient.find(params[:id])

INSERT INTO "patients" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @patient = Patient.new(patient_params)
    if @patient.valid?
      @patient.save