app/controllers/prescriptions_controller.rb

    def new
        @doctors = Doctor.all
        @patients = Patient.all
        @drugs = Drug.all
---
SELECT "doctors".* FROM "doctors"
SELECT "patients".* FROM "patients"
SELECT "drugs".* FROM "drugs"

    def create
        @prescription = Prescription.new(prescription_params)
        @prescription.save
---
INSERT INTO "prescriptions" ("doctor_name", "dosage", "doctor_id", "patient_id", "drug_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["doctor_name", "Steven Brule"], ["dosage", 200], ["doctor_id", 1], ["patient_id", 1], ["drug_id", 111], ["created_at", "2020-05-28 03:30:14.246753"], ["updated_at", "2020-05-28 03:30:14.246753"]]

    def show
        @prescription = Prescription.find(params[:id])
---
SELECT "prescriptions".* FROM "prescriptions" WHERE "prescriptions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]