app/controllers/sessions_controller.rb

  def create
    if params[:patient]
      @patient = Patient.find_by(email: params[:email])
      if @patient && @patient.authenticate(params[:password])
        session[:patient_id] = @patient.id
        redirect_to @patient
      else
        render 'patients/login'
      end
    elsif params[:doctor]
      @doctor = Doctor.find_by(email: params[:email])
---
SELECT "patients".* FROM "patients" WHERE "patients"."email" = ? LIMIT ?  [["email", "alex@gmail.com"], ["LIMIT", 1]]
SELECT "doctors".* FROM "doctors" WHERE "doctors"."email" = ? LIMIT ?  [["email", "a@gmail.com"], ["LIMIT", 1]]